# yolo11_sse_eapiou_s_no_p2.yaml
# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# 
# Simplified YOLO11-S for Medical CT (WITHOUT P2 Layer)
# 优化方向：
#   1. 移除 P2 检测头 - 减少显存占用，提升训练稳定性
#   2. 保留 SSE + RRB 核心改进
#   3. 三尺度检测 (P3/P4/P5) - 更适合主流病灶尺寸
#
# 预期改善：
#   - 更快的训练速度（~30% faster）
#   - 更大的 batch size（显存节省 40%）
#   - 更稳定的梯度（减少小目标噪声）

import:
  - ultralytics.nn.modules.custom_blocks

nc: 1   # 類別數量（單類：病灶）

# ===========================
# Backbone: 特徵提取主幹
# ===========================
backbone:
  # Stage 1: 初始下採樣 (640 -> 160)
  - [-1, 1, Conv, [32, 3, 2]]        # 0-P1/2: 640->320
  - [-1, 1, Conv, [64, 3, 2]]        # 1-P2/4: 320->160
  - [-1, 1, SpatialSEModule, [64]]   # 2: SSE 增強早期特徵

  # Stage 2: P3 特徵層 (160 -> 80)
  - [-1, 1, Conv, [128, 3, 2]]       # 3-P3/8: 160->80 下採樣
  - [-1, 2, RRBBlock, [128]]         # 4: 加强 P3 特徵提取（1→2 blocks）
  - [-1, 1, C2f, [128, True]]        # 5: 多尺度融合

  # Stage 3: P4 特徵層 (80 -> 40)
  - [-1, 1, Conv, [256, 3, 2]]       # 6-P4/16: 80->40
  - [-1, 2, RRBBlock, [256]]         # 7: 加强 P4 特徵提取（1→2 blocks）
  - [-1, 1, C2f, [256, True]]        # 8: 多尺度融合

  # Stage 4: P5 特徵層 (40 -> 20)
  - [-1, 1, Conv, [512, 3, 2]]       # 9-P5/32: 40->20
  - [-1, 2, RRBBlock, [512]]         # 10: 加强 P5 特徵提取（1→2 blocks）
  - [-1, 1, C2f, [512, True]]        # 11: 多尺度融合
  - [-1, 1, SPPF, [512, 5]]          # 12: Spatial Pyramid Pooling

# ===========================
# Head: 特徵融合與檢測頭
# ===========================
head:
  # 上採樣路徑：P5 -> P4 -> P3
  
  # P5 -> P4 融合
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13: 20->40, 512 channels
  - [[-1, 8], 1, Concat, [1]]                   # 14: concat P5(512) + P4(256) = 768 channels
  - [-1, 1, Conv, [256, 1, 1]]                  # 15: 降通道 768->256
  - [-1, 2, RRBBlock, [256]]                    # 16: P4 融合特徵（加强）

  # P4 -> P3 融合
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17: 40->80, 256 channels
  - [[-1, 5], 1, Concat, [1]]                   # 18: concat P4(256) + P3(128) = 384 channels
  - [-1, 1, Conv, [128, 1, 1]]                  # 19: 降通道 384->128
  - [-1, 2, RRBBlock, [128]]                    # 20: P3 融合特徵（加强）

  # 下採樣路徑：P3 -> P4 -> P5
  
  # P3 -> P4 重建
  - [-1, 1, Conv, [128, 3, 2]]                  # 21: 80->40, 128 channels
  - [[-1, 16], 1, Concat, [1]]                  # 22: concat P3(128) + P4(256) = 384 channels
  - [-1, 1, Conv, [256, 1, 1]]                  # 23: 升维 384->256
  - [-1, 2, RRBBlock, [256]]                    # 24: P4 最終特徵（加强）

  # P4 -> P5 重建
  - [-1, 1, Conv, [256, 3, 2]]                  # 25: 40->20, 256 channels
  - [[-1, 12], 1, Concat, [1]]                  # 26: concat P4(256) + P5(512) = 768 channels
  - [-1, 1, Conv, [512, 1, 1]]                  # 27: 升维 768->512
  - [-1, 2, RRBBlock, [512]]                    # 28: P5 最終特徵（加强）

  # Neck Attention：在最高層加強注意力
  - [-1, 1, SpatialSEModule, [512]]             # 29: SSE 再次增強

  # 三尺度檢測頭 (P3, P4, P5)
  - [[20, 24, 29], 1, Detect, [nc]]             # 30: 多尺度檢測輸出
  
  # 輸出說明：
  #   - 20: P3 (80×80)   - 檢測小病灶 (10-30 像素)
  #   - 24: P4 (40×40)   - 檢測中等病灶 (30-80 像素)
  #   - 29: P5 (20×20)   - 檢測大病灶 (> 80 像素)
  #
  # 🔥 相比原版改进：
  #   1. 移除 P2 层，减少 40% 显存占用
  #   2. 每层 RRBBlock 数量增加（1→2），补偿 P2 的特征提取能力
  #   3. 在每个 Concat 后添加 Conv 1×1 降维，解决通道不匹配问题
  #   4. 更适合主流 CT 病灶尺寸分布（大多 > 10 像素）
