# yolo11_custom_ct_s_optimize.yaml
# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# ✅ S 規模 + AAF_CT + RRB + C2f(P4/P5) + SAT(Neck, heads=8) + Kaiming Init
# 👉 增強版：多尺度融合 + 穩定訓練 + 梯度優化
import:
  - ultralytics.nn.modules.custom_blocks

nc: 1   # 類別數量
 
backbone:
  - [-1, 1, Conv, [32, 3, 2]]        # 0
  - [-1, 1, Conv, [64, 3, 2]]        # 1
  - [-1, 1, AAF_CT, [64]]           # 2 ✅ 注意力模組（帶梯度裁剪）
  - [-1, 1, Conv, [128, 1, 1]]      # 3 升維
  - [-1, 1, RRBBlock, [128]]        # 4 ✅ 保留
  - [-1, 1, Conv, [128, 3, 2]]      # 5
  - [-1, 1, RRBBlock, [128]]        # 6 ✅ 保留（P3）
  - [-1, 1, Conv, [256, 3, 2]]      # 7 (P4 入口)
  - [-1, 1, RRBBlock, [256]]        # 8 ✅ P4 特徵提取
  - [-1, 1, C2f, [256, True]]       # 9 ✅ 新增：P4 多尺度融合
  - [-1, 1, Conv, [512, 3, 2]]      # 10 (P5 入口)
  - [-1, 1, RRBBlock, [512]]        # 11 ✅ P5 特徵提取
  - [-1, 1, C2f, [512, True]]       # 12 ✅ 新增：P5 多尺度融合
  - [-1, 1, SPPF, [512, 5]]         # 13

head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 9], 1, Concat, [1]]                   # 15 (連接 P4 的 C2f 輸出)
  - [-1, 1, Conv, [256, 1, 1]]                  # 16 降通道
  - [-1, 1, RRBBlock, [256]]                    # 17 ✅ 保留一個 RRB（融合層）

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 6], 1, Concat, [1]]                   # 19
  - [-1, 1, Conv, [128, 1, 1]]                  # 20
  - [-1, 1, RRBBlock, [128]]                    # 21 ✅

  # P3 -> P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 22
  - [[-1, 1], 1, Concat, [1]]                   # 23
  - [-1, 1, Conv, [64, 1, 1]]                   # 24
  - [-1, 1, RRBBlock, [64]]                     # 25 ✅ 保留前端

  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]                  # 26
  - [[-1, 21], 1, Concat, [1]]                  # 27
  - [-1, 1, Conv, [256, 1, 1]]                  # 28
  - [-1, 1, RRBBlock, [256]]                    # 29

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]                  # 30
  - [[-1, 17], 1, Concat, [1]]                  # 31
  - [-1, 1, Conv, [512, 1, 1]]                  # 32
  - [-1, 1, RRBBlock, [512]]                    # 33 ✅ 最終層保留

  # Neck Transformer (穩定版，heads=4)
  - [-1, 1, SATModule, [512, 4]]                # 34 ✅ heads=4（從8降至4以穩定訓練）

  # Detect (P2, P3, P4, P5) - 四層特徵輸出
  - [[25, 21, 29, 34], 1, Detect, [nc]]         # 35 ✅ P2/P3/P4/P5
