# yolo11_custom_ct_s.yaml
# Ultralytics рҹҡҖ AGPL-3.0 License - https://ultralytics.com/license
# вң… YOLOv11-S иҰҸжЁЎ + AAF_CT + RRBBlock + SATModuleпјҢйҒ©з”Ё CT-only
import:
  - ultralytics.nn.modules.custom_blocks

nc: 1

# ------------------------------
# рҹ§ұ Backbone
# ------------------------------
backbone:
  - [-1, 1, Conv, [32, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]        # 1-P2/4
  - [-1, 1, AAF_CT, [64]]           # 2  CT зү№еҫөеўһеј·
  - [-1, 1, Conv, [128, 1, 1]]      # 3  еҚҮз¶ӯ вҶ’ RRB еүҚ
  - [-1, 1, RRBBlock, [128]]        # 4
  - [-1, 1, Conv, [128, 3, 2]]      # 5-P3/8
  - [-1, 1, RRBBlock, [128]]        # 6
  - [-1, 1, Conv, [256, 3, 2]]      # 7-P4/16
  - [-1, 1, RRBBlock, [256]]        # 8
  - [-1, 1, Conv, [512, 3, 2]]      # 9-P5/32
  - [-1, 1, RRBBlock, [512]]        # 10
  - [-1, 1, SPPF, [512, 5]]        # 11

# ------------------------------
# рҹ§  Head (PAN + SAT)
# ------------------------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12 вҶ‘ P5вҶ’P4
  - [[-1, 7], 1, Concat, [1]]                   # 13 512+256=768
  - [-1, 1, Conv, [256, 1, 1]]                 # 14 йҖҡйҒ“еЈ“зё® 768вҶ’256
  - [-1, 1, RRBBlock, [256]]                    # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16 вҶ‘ P4вҶ’P3
  - [[-1, 5], 1, Concat, [1]]                   # 17 256+128=384
  - [-1, 1, Conv, [128, 1, 1]]                 # 18 384вҶ’128
  - [-1, 1, RRBBlock, [128]]                    # 19

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 20 вҶ‘ P3вҶ’P2
  - [[-1, 1], 1, Concat, [1]]                   # 21 128+64=192
  - [-1, 1, Conv, [64, 1, 1]]                  # 22 192вҶ’64
  - [-1, 1, RRBBlock, [64]]                     # 23

  - [-1, 1, Conv, [128, 3, 2]]                  # 24 вҶ“ P2вҶ’P3
  - [[-1, 19], 1, Concat, [1]]                  # 25 128+128=256
  - [-1, 1, Conv, [256, 1, 1]]                 # 26
  - [-1, 1, RRBBlock, [256]]                    # 27

  - [-1, 1, Conv, [256, 3, 2]]                  # 28 вҶ“ P3вҶ’P4
  - [[-1, 15], 1, Concat, [1]]                  # 29 256+256=512
  - [-1, 1, Conv, [512, 1, 1]]                 # 30
  - [-1, 1, RRBBlock, [512]]                    # 31

  - [-1, 1, SATModule, [512]]                   # 32 иј•йҮҸ Transformer Neck Head

  - [[23, 19, 27, 32], 1, Detect, [nc]]         # 33 Detect P2~P5
