# yolo11_sse_eapiou_s.yaml
# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# 
# Enhanced YOLO11-S for Medical CT Lesion Detection
# 主要改進：
#   1. SpatialSEModule (SSE): 融合通道+空間注意力，強化小目標特徵
#   2. RRBBlock: RepVGG-style 重參殘差塊，訓練時多分支，推理時單路徑
#   3. EAPIoU Loss: 加入寬高比懲罰的改進 IoU（需在訓練腳本中啟用）
#   4. 四尺度檢測 (P2/P3/P4/P5): 針對多尺度病灶優化
#
# 預期性能（基於論文 LungCT 實驗）：
#   - mAP@0.5: ≥ 0.90
#   - Precision: ≥ 0.78
#   - Parameters: < 3M
#   - FLOPs: < 7G

import:
  - ultralytics.nn.modules.custom_blocks

nc: 1   # 類別數量（單類：病灶）

# ===========================
# Backbone: 特徵提取主幹
# ===========================
backbone:
  # Stage 1: 初始下採樣 (640 -> 160)
  - [-1, 1, Conv, [32, 3, 2]]        # 0-P1/2: 640->320
  - [-1, 1, Conv, [64, 3, 2]]        # 1-P2/4: 320->160
  - [-1, 1, SpatialSEModule, [64]]   # 2: SSE 增強早期特徵（對應論文）

  # Stage 2: P3 特徵層 (160 -> 80)
  - [-1, 1, Conv, [128, 1, 1]]       # 3: 升維到 128
  - [-1, 1, RRBBlock, [128]]         # 4: 重參殘差塊
  - [-1, 1, Conv, [128, 3, 2]]       # 5-P3/8: 160->80 下採樣
  - [-1, 1, RRBBlock, [128]]         # 6: P3 特徵提取

  # Stage 3: P4 特徵層 (80 -> 40)
  - [-1, 1, Conv, [256, 3, 2]]       # 7-P4/16: 80->40
  - [-1, 1, RRBBlock, [256]]         # 8: P4 特徵提取
  - [-1, 1, C2f, [256, True]]        # 9: 多尺度融合（YOLO11 標準模組）

  # Stage 4: P5 特徵層 (40 -> 20)
  - [-1, 1, Conv, [512, 3, 2]]       # 10-P5/32: 40->20
  - [-1, 1, RRBBlock, [512]]         # 11: P5 特徵提取
  - [-1, 1, C2f, [512, True]]        # 12: 多尺度融合
  - [-1, 1, SPPF, [512, 5]]          # 13: Spatial Pyramid Pooling (增強感受野)

# ===========================
# Head: 特徵融合與檢測頭
# ===========================
head:
  # 上採樣路徑：P5 -> P4 -> P3 -> P2
  
  # P5 -> P4 融合
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14: 20->40
  - [[-1, 9], 1, Concat, [1]]                   # 15: 接 P4 的 C2f 輸出
  - [-1, 1, Conv, [256, 1, 1]]                  # 16: 降通道
  - [-1, 1, RRBBlock, [256]]                    # 17: P4 融合特徵

  # P4 -> P3 融合
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18: 40->80
  - [[-1, 6], 1, Concat, [1]]                   # 19: 接 P3
  - [-1, 1, Conv, [128, 1, 1]]                  # 20: 降通道
  - [-1, 1, RRBBlock, [128]]                    # 21: P3 融合特徵

  # P3 -> P2 融合（檢測最小病灶 <15px）
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 22: 80->160, 128 channels
  - [[-1, 2], 1, Concat, [1]]                   # 23: concat P3(128) + P2_SSE(64) = 192 channels
  - [-1, 1, Conv, [64, 1, 1]]                   # 24: 降通道 192->64
  - [-1, 1, RRBBlock, [64]]                     # 25: P2 融合特徵（最細粒度）

  # 下採樣路徑：P2 -> P3 -> P4 -> P5
  
  # P2 -> P3 重建
  - [-1, 1, Conv, [128, 3, 2]]                  # 26: 160->80, 128 channels
  - [[-1, 21], 1, Concat, [1]]                  # 27: concat P2(128) + P3(128) = 256 channels
  - [-1, 1, Conv, [128, 1, 1]]                  # 28: 降维 256->128
  - [-1, 1, RRBBlock, [128]]                    # 29: P3 最終特徵

  # P3 -> P4 重建
  - [-1, 1, Conv, [256, 3, 2]]                  # 30: 80->40, 256 channels
  - [[-1, 17], 1, Concat, [1]]                  # 31: concat P3(256) + P4(256) = 512 channels
  - [-1, 1, Conv, [256, 1, 1]]                  # 32: 降维 512->256
  - [-1, 1, RRBBlock, [256]]                    # 33: P4 最終特徵（加强）

  # Neck Attention：在最高層加強注意力
  - [-1, 1, SpatialSEModule, [256]]             # 34: SSE 再次增強（替代原 SATModule）

  # 四尺度檢測頭 (P2, P3, P4, P5) + Deep Supervision
  - [[25, 29, 33, 34], 1, Detect, [nc]]         # 35: 多尺度檢測輸出
  
  # 輸出說明：
  #   - 25: P2 (160×160) - 檢測極小病灶 (< 10 像素)
  #   - 29: P3 (80×80)   - 檢測小病灶 (10-30 像素)
  #   - 33: P4 (40×40)   - 檢測中等病灶 (30-80 像素)
  #   - 34: P5 (20×20)   - 檢測大病灶 (> 80 像素)
