# YOLOv7 Architecture with Medical Image Detection Modules
# Modified from original YOLOv7 with:
# - CBAM after each ELAN stage
# - Swin Transformer Block before neck
# - BiFPN neck (replacing PAN)
# - SimAM before detection heads

# Parameters
nc: 1  # number of classes (lesion detection)
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# Anchors for detection heads (3 scales)
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# YOLOv7 backbone with medical modules
backbone:
  # [from, number, module, args]
  
  # Stem
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],  # 2
   
   # Stage 1
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11-ELAN1
   [-1, 1, CBAM, [256, 16]],  # 12-CBAM after ELAN1
   
   # Stage 2
   [-1, 1, MP, []],  # 13-P3/8
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 25-ELAN2
   [-1, 1, CBAM, [512, 16]],  # 26-CBAM after ELAN2
   
   # Stage 3
   [-1, 1, MP, []],  # 27-P4/16
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 39-ELAN3
   [-1, 1, CBAM, [1024, 16]],  # 40-CBAM after ELAN3
   [-1, 1, SwinTransformerBlock, [1024, 8, 7]],  # 41-Swin Transformer
   
   # Stage 4
   [-1, 1, MP, []],  # 42-P5/32
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 54-ELAN4
   [-1, 1, CBAM, [1024, 16]],  # 55-CBAM after ELAN4
  ]

# BiFPN Neck (replacing PAN)
head:
  [
   # Prepare features for BiFPN (P3, P4, P5)
   [26, 1, Conv, [256, 1, 1]],  # 56-P3 feature
   [41, 1, Conv, [256, 1, 1]],  # 57-P4 feature  
   [55, 1, Conv, [256, 1, 1]],  # 58-P5 feature
   
   # BiFPN layer
   [[56, 57, 58], 1, BiFPN, [256, 3]],  # 59-BiFPN outputs [P3, P4, P5]
   
   # Split BiFPN outputs for separate detection heads
   [59, 1, Split, [0]],  # 60-P3 from BiFPN
   [59, 1, Split, [1]],  # 61-P4 from BiFPN
   [59, 1, Split, [2]],  # 62-P5 from BiFPN
   
   # Detection heads with SimAM
   # P3 detection
   [60, 1, SimAM, []],  # 63-SimAM before P3 head
   [-1, 1, Conv, [256, 3, 1]],  # 64-P3 conv
   
   # P4 detection
   [61, 1, SimAM, []],  # 65-SimAM before P4 head
   [-1, 1, Conv, [512, 3, 1]],  # 66-P4 conv
   
   # P5 detection
   [62, 1, SimAM, []],  # 67-SimAM before P5 head
   [-1, 1, Conv, [1024, 3, 1]],  # 68-P5 conv
   
   # Combine detections
   [[64, 66, 68], 1, Detect, [nc, anchors]],  # 69-Detect(P3, P4, P5)
  ]
