# yolo11_custom_ct_n.yaml
# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# ✅ Nano 規模 + AAF_CT + 精簡版 RRB + SATModule
# 適合邊緣部署 / 輕量 CT 偵測

import:
  - ultralytics.nn.modules.custom_blocks

nc: 1

# ------------------------------------------------------------
# 🧱 Backbone
# ------------------------------------------------------------
backbone:
  - [-1, 1, Conv, [16, 3, 2]]         # 0  P1/2
  - [-1, 1, Conv, [32, 3, 2]]         # 1  P2/4
  - [-1, 1, AAF_CT, [32]]            # 2  CT 注意力
  - [-1, 1, Conv, [64, 1, 1]]        # 3  升維
  - [-1, 1, RRBBlock, [64]]          # 4
  - [-1, 1, Conv, [64, 3, 2]]        # 5  P3/8
  - [-1, 1, RRBBlock, [64]]          # 6
  - [-1, 1, Conv, [128, 3, 2]]       # 7  P4/16
  - [-1, 1, Conv, [128, 1, 1]]       # 8  精簡，不用RRB
  - [-1, 1, Conv, [256, 3, 2]]       # 9  P5/32
  - [-1, 1, Conv, [256, 1, 1]]       # 10 精簡，不用RRB
  - [-1, 1, SPPF, [256, 5]]         # 11

# ------------------------------------------------------------
# 🧠 Head
# ------------------------------------------------------------
head:
  # P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 7], 1, Concat, [1]]                   # 13
  - [-1, 1, Conv, [128, 1, 1]]                  # 14
  - [-1, 1, RRBBlock, [128]]                    # 15

  # P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 5], 1, Concat, [1]]                   # 17
  - [-1, 1, Conv, [64, 1, 1]]                   # 18
  - [-1, 1, RRBBlock, [64]]                     # 19

  # P3 → P2 (最低層)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 20
  - [[-1, 1], 1, Concat, [1]]                   # 21
  - [-1, 1, Conv, [32, 1, 1]]                   # 22
  - [-1, 1, RRBBlock, [32]]                     # 23

  # P2 → P3
  - [-1, 1, Conv, [64, 3, 2]]                   # 24
  - [[-1, 19], 1, Concat, [1]]                  # 25
  - [-1, 1, Conv, [64, 1, 1]]                   # 26
  - [-1, 1, RRBBlock, [64]]                     # 27

  # P3 → P4
  - [-1, 1, Conv, [128, 3, 2]]                  # 28
  - [[-1, 15], 1, Concat, [1]]                  # 29
  - [-1, 1, Conv, [128, 1, 1]]                  # 30
  - [-1, 1, RRBBlock, [128]]                    # 31

  # SAT 模組在最深層
  - [-1, 1, SATModule, [128]]                   # 32  輕量 Transformer

  # Detect head
  - [[23, 19, 27, 32], 1, Detect, [nc]]         # 33
